nachoislas/LevitadorGMI--Experimental-magnetic-levitator-model-/STM32Levitador/pulseV3/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define COUNTER_PMT_2_Pin GPIO_PIN_0
#define COUNTER_PMT_2_GPIO_Port GPIOA
#define LED_PWR_1_Pin GPIO_PIN_4
#define LED_PWR_1_GPIO_Port GPIOA
#define LED_POWER_2_Pin GPIO_PIN_5
#define LED_POWER_2_GPIO_Port GPIOA
#define LED_LVL_1_Pin GPIO_PIN_6
#define LED_LVL_1_GPIO_Port GPIOA
#define LED_LVL_2_Pin GPIO_PIN_7
#define LED_LVL_2_GPIO_Port GPIOA
#define BT1_Pin GPIO_PIN_0
#define BT1_GPIO_Port GPIOB
#define BT2_Pin GPIO_PIN_1
#define BT2_GPIO_Port GPIOB
#define BT3_Pin GPIO_PIN_2
#define BT3_GPIO_Port GPIOB
#define PSU_CTRL_1_Pin GPIO_PIN_11
#define PSU_CTRL_1_GPIO_Port GPIOB
#define PSU_STS_1_Pin GPIO_PIN_12
#define PSU_STS_1_GPIO_Port GPIOB
#define PSU_CTRL_2_Pin GPIO_PIN_14
#define PSU_CTRL_2_GPIO_Port GPIOB
#define PSU_STS_2_Pin GPIO_PIN_15
#define PSU_STS_2_GPIO_Port GPIOB
#define COVER_Pin GPIO_PIN_8
#define COVER_GPIO_Port GPIOA
#define COUNTER_PMT_1_Pin GPIO_PIN_6
#define COUNTER_PMT_1_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
